:PROPERTIES:
:ID:       292ecba9-bd17-40cd-b3cd-aceec77ebe6d
:mtime:    20230206181335 20220528222421
:ctime:    20220129131526
:END:
#+title: clojure

[[id:0e26b9f4-4a02-4e79-ae0c-d9cc4813bab1][clj-cheatsheets]]

* basic syntax
file type .clj
(operator operand operand)
namespace is used to define a logical boundary between modules defined in
Clojure
current namespace defines the current namespace in which the current clojure
code resides in.
+ *ns*

forms: clojure recognizes two kinds of structures
+ literal representations of data structures
  + number, strings, maps, and vectors
+ operations
form refers to valid code
+ expression refers to Clojure forms
clojure evaluates every form to produce a value
rarely use free-floating literals
+ instead you use literals in operations
operations: are how you do things
+ operations takes the from of
  + opening parenthesis, operator, operands, closing parenthesis
  + (operator operand1 operand2 ... operandn)
clojure uses whitespace to separate operands
+ treats commas as whitespace
clojure structure stays the same no matter what operator you use or what data
you're operating on

#+begin_src clojure :results output
;; semantics: println is a function call, "hello" is a argument
(println "hello World")
;; structure: () is a list, println is a symbol, "hello" is a string
#+end_src

#+RESULTS:
: hello World


